export TERM="screen-256color"

#                             \u haoran     @            \h 主机        \W 最后一个目录            \$ 提示字符
PS1="\[\e[32;1m\][\[\e[33;1m\]\u\[\e[31;1m\]@\[\e[33;1m\]\h \[\e[36;1m\]\W\[\e[32;1m\]]\[\e[35;1m\]\$ \[\e[0m\]"

# \d ：代表日期，格式为weekday month date，例如："Mon Aug 1"
# \H ：完整的主机名称
# \h ：仅取主机的第一个名字
# \t ：显示时间为24小时格式，如：HH:MM:SS
# \T ：显示时间为12小时格式
# \A ：显示时间为24小时格式：HH:MM
# \u ：当前用户的账号名称
# \v ：BASH的版本信息
# \w ：完整的工作目录名称。家目录会以 ~代替
# \W ：利用basename取得工作目录名称，所以只会列出最后一个目录
# \# ：下达的第几个命令
# \$ ：提示字符，如果是root时，提示符为：# ，普通用户则为：$
